{
  "title": "Voice in a Can",
  "product_url": "http://voiceinacan.com/",
  "description": "Alexa on your Apple Watch (standalone, no phone required), your iPhone and iPad.\r\n\r\n\r\nControl your home devices, ask general questions, add items to your shopping list and set timers etc. It is an Alexa implementation. On your wrist.\r\n\r\n\r\nThere are ten things you should know before getting this app:\r\n\r\n\r\n1. The very first Apple Watch (from 2015) is not supported; The best experience is with the Apple Watch 4 and newer. Whilst the app works with older Apple Watches, the experience is slow;\r\n\r\n3. Your phone controls installation of the app to the watch, not the app. Put your watch on a charger to speed up install time;\r\n\r\n4. Not all audio content can be supported. Amazon don't allow third-party apps such as this app to play music, audio books or some daily-news content, and make announcements;\r\n\r\n5. You can use a Siri Shortcut to launch the app and start speaking, just by raising your wrist on Apple Watch. See the support page on how to configure;\r\n\r\n6. All watch complication types are supported, including those really weird ones. Also you can change the complication icon under Settings;\r\n\r\n7. The watch app listens automatically on launch. There is an option under settings to do the same thing on the iPhone;\r\n\r\n8. If the weather or time are wrong, ensure you've enabled Location access in the Alexa app to the \"Voice in a Can\" device, and that you have granted Location permissions to the app on your phone;\r\n\r\n9. You don't have to say \"Alexa\" ... just speak your command when the app is listening;\r\n\r\n10. You can change the language that you speak and hear responses in, under \"Settings\" on the watch and phone. Only languages supported by Alexa are supported. The language should be set automatically.\r\n\r\n\r\nIf you have questions or any support issues please don't hesitate to email damian@voiceinacan.com ... you should get a response within 24 hours, and often in minutes.\r\n\r\n\r\nVoice in a Can is in no way associated with Amazon.",
  "producthunt_url": "https://www.producthunt.com/products/voice-in-a-can",
  "crawl_timestamp": "2025-04-02T03:28:34.312525"
}